In [1]:
import psycopg2 #import the PostgreSQL adapter
import pandas as pd #Used for data analysis and manipilation
from sqlalchemy import create_engine #function to vreat a database engine
import numpy as np #For array manipulation
from psycopg2 import OperationalError
import re #python string library

In [2]:
def create_connection(db_name, db_user, db_password, db_host, db_port): #Python function to create a connection to PostgreSQL server. (Reused from Data Warehousing Lab3)
    connection = None
    try:
        connection = psycopg2.connect(
            database=db_name,
            user=db_user,
            password=db_password,
            host=db_host,
            port=db_port,
        )
        print("Connection to PostgreSQL DB successful")
    except OperationalError as e:
        print(f"The error '{e}' occurred")
    return connection

In [3]:
db_name = "Olympic"  #database parameters
db_user = "postgres"
db_password = "postgres"  
db_host = "localhost"  
db_port = "5432"
db_server = "dw_2024"

In [4]:
connection = create_connection(db_name, db_user, db_password, db_host, db_port)  #Create connection to the PostgreSQL server function

Connection to PostgreSQL DB successful

In [5]:
cursor = connection.cursor() #Cursor allow python code to execute PostgreSQL command in a database session

In [6]:
connection_string = f"postgresql+psycopg2://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}" #connection string to the database
engine = create_engine(connection_string) #Create engine for the database

In [112]:
countries_df = pd.read_csv("./list-of-countries_areas-by-continent-2024.csv", header=None)

In [113]:
countries_df.columns = ["country", "continent"]

In [114]:
hosts_df = pd.read_csv("./olympic_hosts.csv", header=0)

In [115]:
hosts_df.columns = ["hostid", "enddate", "startdate","location","name","season","year"]

In [116]:
lifeexp_df = pd.read_csv("./life-expectancy.csv", header=0)

In [117]:
lifeexp_df.columns= ["country","code","year","lifeexpectancy"]

In [118]:
medals_df = pd.read_csv("./olympic_medals.csv", header=0)

In [119]:
medals_df.columns = ["discipline","year","event","gender","medal","participanttype","participanttitle","url","name","country","code","code3"]

In [120]:
mental_df = pd.read_csv("./mental-illness.csv",header=0)

In [121]:
mental_df.columns = ["country","code","year","depression","schizophrenia","bipolar","eatingdisorder","anxiety"]

In [122]:
economic_df = pd.read_csv("./Economic data.csv",header=0)

In [123]:
economic_df.columns = ["year", "yearcode", "country", "code", "poverty", "gdpcap", "gdpgrowth", "intsrv","mort", "hlthexp", "govhlthcap", "prvhlthcap", "exthlthcap"]

In [124]:
population_df = pd.read_csv("./Global Population.csv",header=0,encoding='ISO-8859-1')

In [125]:
#Data Cleaning

In [126]:
hosts_df['enddate'] = pd.to_datetime(hosts_df['enddate'], format='%Y-%m-%dT%H:%M:%SZ') #Convert the start times to datetime format
hosts_df['startdate'] = pd.to_datetime(hosts_df['startdate'], format='%Y-%m-%dT%H:%M:%SZ') #Convert the end times to datetime format

In [127]:
lifeexp_df = lifeexp_df.dropna() #lifeexpectancy has continents with na country codes which will not be required so they are dropped from the dataframe

In [23]:
medals_df=medals_df.dropna() #mental illness dataframe has rows with no counntry codes that are regions and continents which will be dropped from the dataframe

In [128]:
economic_df['poverty'] = economic_df['poverty'].replace('..', np.nan) #In each column in the economy data frame there are strings ".." for values with no data which will be replace with NaN 
economic_df['gdpcap'] = economic_df['gdpcap'].replace('..', np.nan)
economic_df['gdpgrowth'] = economic_df['gdpgrowth'].replace('..', np.nan)
economic_df['intsrv'] = economic_df['intsrv'].replace('..', np.nan)
economic_df['mort'] = economic_df['mort'].replace('..', np.nan)
economic_df['hlthexp'] = economic_df['hlthexp'].replace('..', np.nan)
economic_df['govhlthcap'] = economic_df['govhlthcap'].replace('..', np.nan)
economic_df['prvhlthcap'] = economic_df['prvhlthcap'].replace('..', np.nan)
economic_df['exthlthcap'] = economic_df['exthlthcap'].replace('..', np.nan)

In [129]:
economic_df=economic_df[0:-5] # Last five rows are invalid rows containing info about the data and spaces in the csv file

In [130]:
population_df = pd.melt(population_df, id_vars=["Population (Millions of people)"], var_name="Year", value_name="Population")

In [131]:
population_df['Population'] = population_df['Population'].replace('no data', np.nan)

In [132]:
population_df.columns = ["country","year","population"]

In [133]:
def extract_year(value):
    year_pattern = r'\b(18|19|20)\d{2}\b'
    match = re.search(year_pattern, value)
    if match:
        return int(match.group(0))  # Convert the matched year to an integer
    else:
        return None 
        
medals_df['year'] = medals_df['year'].apply(extract_year)  #To obtain the year from the title event.

In [134]:
medals_df = medals_df.drop(columns=["code"]) #To drop the coutnry code with only two characters as standard and other tables follow the three letter structure

In [135]:
medals_df = medals_df.rename(columns={"code3":"code"}) #Rename column to code

In [ ]:
#Create SQL tables in the PostgreSQL database and upload the data from the dataframes to the tables

In [38]:
cursor.execute("CREATE TABLE countries (country VARCHAR(255) NOT NULL PRIMARY KEY, continent VARCHAR(255) NOT NULL);")

In [39]:
connection.commit()

In [40]:
countries_df.to_sql("countries", con=engine, if_exists="append", index=False)

235

In [42]:
cursor.execute("CREATE TABLE economic (year INT NOT NULL, yearcode VARCHAR(255) NOT NULL, country VARCHAR(255) NOT NULL, code VARCHAR(3) NOT NULL,poverty FLOAT,gdpcap FLOAT,gdpgrowth FLOAT,intsrv FLOAT, mort FLOAT, hlthexp FLOAT, govhlthcap FLOAT, prvhlthcap FLOAT, exthlthcap FLOAT);")

In [43]:
connection.commit()

In [44]:
economic_df.to_sql("economic", con=engine, if_exists="append", index=False)

200

In [54]:
cursor.execute("CREATE TABLE population (country VARCHAR(255), year INT NOT NULL, population FLOAT);")

In [55]:
connection.commit()

In [56]:
population_df.to_sql("population", con=engine, if_exists="append", index=False)

318

In [89]:
cursor.execute("ROLLBACK")

In [66]:
cursor.execute("CREATE TABLE lifeexp  (country VARCHAR(255) NOT NULL, code VARCHAR(255) NOT NULL, year INT NOT NULL, lifeexpectancy FLOAT);")

In [67]:
connection.commit()

In [68]:
lifeexp_df.to_sql("lifeexp", con=engine, if_exists="append", index=False)

61

In [76]:
cursor.execute("CREATE TABLE millness  (country VARCHAR(255) NOT NULL, code VARCHAR(255), year INT NOT NULL, depression FLOAT, schizophrenia FLOAT, bipolar FLOAT, eatingdisorder FLOAT, anxiety FLOAT);")

In [77]:
connection.commit()

In [78]:
mental_df.to_sql("millness", con=engine, if_exists="append", index=False)

840

In [81]:
cursor.execute("CREATE TABLE hosts  (hostid VARCHAR(255) NOT NULL PRIMARY KEY, enddate TIMESTAMP WITH TIME ZONE, startdate TIMESTAMP WITH TIME ZONE, location VARCHAR(255), name	 VARCHAR(255), season VARCHAR(255), year INT);")

In [82]:
connection.commit()

In [83]:
hosts_df.to_sql("hosts", con=engine, if_exists="append", index=False)

53

In [94]:
cursor.execute("CREATE TABLE medals (discipline VARCHAR(255), year INT NOT NULL, event VARCHAR(255), gender VARCHAR(255), medal VARCHAR(255), participanttype VARCHAR(255),participanttitle VARCHAR(255), url VARCHAR(255),name VARCHAR(255), country VARCHAR(255), code VARCHAR(255));")

In [96]:
connection.commit()

In [97]:
medals_df.to_sql("medals",con=engine,if_exists="append", index=False)

667

In [98]:
#Creating the facttable and dimension tables

In [100]:
#For the facttable my columns are factid,country,year,sum of bronze for that year, sum of silver for that year, sum of gold for that year, mental health statistics

In [261]:
medal_sums = medals_df.groupby(['year', 'country', 'medal']).size().unstack(fill_value=0)

In [262]:
medal_sums = medal_sums.reset_index()

In [263]:
years = hosts_df.drop_duplicates()

In [264]:
years = hosts_df["year"]

In [265]:
year = pd.DataFrame(data = hosts_df["year"],columns=["year"])

In [266]:
year = year.drop_duplicates()

In [267]:
year

    year
0   2022
1   2020
2   2018
3   2016
4   2014
5   2012
6   2010
7   2008
8   2006
9   2004
10  2002
11  2000
12  1998
13  1996
14  1994
15  1992
17  1988
19  1984
21  1980
23  1976
25  1972
27  1968
29  1964
31  1960
33  1956
35  1952
37  1948
39  1936
41  1932
43  1928
45  1924
47  1920
48  1912
49  1908
50  1904
51  1900
52  1896

In [272]:
medal_sums.columns = ["medal","year","bronze","gold","silver"]

In [279]:
all_years_countries = pd.MultiIndex.from_product([year["year"], countries_df['country']], names=['year', 'country']).to_frame(index=False)

In [280]:
all_years_countries

      year           country
0     2022           country
1     2022             India
2     2022             China
3     2022     United States
4     2022         Indonesia
...    ...               ...
8690  1896        Montserrat
8691  1896  Falkland Islands
8692  1896              Niue
8693  1896           Tokelau
8694  1896      Vatican City

[8695 rows x 2 columns]

In [281]:
medal_sums

      medal                      year  bronze  gold  silver
0      1896                 Australia       0     2       0
1      1896                   Austria       2     2       1
2      1896                   Denmark       3     1       2
3      1896                    France       2     5       4
4      1896                   Germany       2     6       5
...     ...                       ...     ...   ...     ...
1561   2022                     Spain       0     0       1
1562   2022                    Sweden       6     8       6
1563   2022               Switzerland       5     7       2
1564   2022                   Ukraine       0     0       1
1565   2022  United States of America       9     9      10

[1566 rows x 5 columns]